type Upazila = string;

type District = {
  জেলা: string;
  উপজেলা: Upazila[];
};

type Division = {
  [key: string]: District[];
};

export const bangladeshDivisions: Division = {
  "চট্টগ্রাম বিভাগ": [
    {
      "জেলা": "কুমিল্লা",
      "উপজেলা": [
        "দেবিদ্বার",
        "বরুড়া",
        "ব্রাহ্মণপাড়া",
        "চান্দিনা",
        "চৌদ্দগ্রাম",
        "দাউদকান্দি",
        "হোমনা",
        "লাকসাম",
        "মুরাদনগর",
        "নাঙ্গলকোট",
        "কুমিল্লা সদর",
        "মেঘনা",
        "মনোহরগঞ্জ",
        "সদর দক্ষিণ",
        "তিতাস",
        "বুড়িচং",
        "লালমাই"
      ]
    },
    {
      "জেলা": "ফেনী",
      "উপজেলা": [
        "ছাগলনাইয়া উপজেলা",
        "ফেনী সদর",
        "সোনাগাজী উপজেলা",
        "ফুলগাজী উপজেলা",
        "পরশুরাম",
        "দাগনভূঞা"
      ]
    },
    {
      "জেলা": "ব্রাহ্মণবাড়িয়া",
      "উপজেলা": [
        "ব্রাহ্মণবাড়িয়া সদর",
        "কসবা",
        "নাসিরনগর",
        "সরাইল উপজেলা",
        "আশুগঞ্জ",
        "আখাউড়া",
        "নবীনগর",
        "বাঞ্ছারামপুর",
        "বিজয়নগর"
      ]
    },
    {
      "জেলা": "রাঙ্গামাটি",
      "উপজেলা": [
        "রাঙ্গামাটি সদর",
        "কাপ্তাই",
        "কাউখালী",
        "বাঘাইছড়ি",
        "বরকল",
        "লংগদু",
        "রাজস্থলী",
        "বিলাইছড়ি",
        "জুরাছড়ি",
        "নানিয়ারচর"
      ]
    },
    {
      "জেলা": "নোয়াখালী",
      "উপজেলা": [
        "নোয়াখালী",
        "কোম্পানীগঞ্জ",
        "বেগমগঞ্জ",
        "হাতিয়া",
        "সুবর্ণচর",
        "কবিরহাট",
        "সেনবাগ",
        "চাটখিল",
        "সোনাইমুড়ী"
      ]
    },
    {
      "জেলা": "চাঁদপুর",
      "উপজেলা": [
        "হাইমচর",
        "কচুয়া",
        "শাহরাস্তি",
        "চাঁদপুর সদর",
        "মতলব",
        "হাজীগঞ্জ",
        "ফরিদগঞ্জ"
      ]
    },
    {
      "জেলা": "লক্ষ্মীপুর",
      "উপজেলা": [
        "লক্ষ্মীপুর সদর",
        "কমলনগর",
        "রায়পুর",
        "রামগতি",
        "রামগঞ্জ"
      ]
    },
    {
      "জেলা": "চট্টগ্রাম",
      "উপজেলা": [
        "রাঙ্গুনিয়া",
        "সীতাকুন্ড উপজেলা",
        "মীরসরাই",
        "পটিয়া",
        "সন্দ্বীপ",
        "বাঁশখালী",
        "বোয়ালখালী",
        "আনোয়ারা",
        "চন্দনাইশ",
        "সাতকানিয়া",
        "লোহাগাড়া",
        "হাটহাজারী",
        "ফটিকছড়ি",
        "রাউজান",
        "কর্ণফুলী"
      ]
    },
    {
      "জেলা": "কক্সবাজার",
      "উপজেলা": [
        "কক্সবাজার সদর",
        "চকরিয়া",
        "কুতুবদিয়া",
        "উখিয়া",
        "মহেশখালী",
        "পেকুয়া",
        "রামু",
        "টেকনাফ"
      ]
    },
    {
      "জেলা": "খাগড়াছড়ি",
      "উপজেলা": [
        "খাগড়াছড়ি সদর",
        "দিঘীনালা",
        "পানছড়ি",
        "লক্ষীছড়ি",
        "মহালছড়ি",
        "মানিকছড়ি",
        "রামগড়",
        "মাটিরাঙ্গা",
        "গুইমারা"
      ]
    },
    {
      "জেলা": "বান্দরবান",
      "উপজেলা": [
        "বান্দরবান সদর",
        "আলীকদম",
        "নাইক্ষ্যংছড়ি",
        "রোয়াংছড়ি",
        "লামা",
        "রুমা",
        "থানচি"
      ]
    }
  ],
  "রাজশাহী বিভাগ": [
    {
      "জেলা": "সিরাজগঞ্জ",
      "উপজেলা": [
        "বেলকুচি",
        "চৌহালি",
        "কামারখন্দ",
        "কাজীপুর",
        "রায়গঞ্জ",
        "শাহজাদপুর",
        "সিরাজগঞ্জ",
        "তাড়াশ",
        "উল্লাপাড়া"
      ]
    },
    {
      "জেলা": "পাবনা",
      "উপজেলা": [
        "সুজানগর",
        "ঈশ্বরদী",
        "ভাঙ্গুড়া",
        "পাবনা সদর",
        "বেড়া",
        "আটঘরিয়া",
        "চাটমোহর",
        "সাঁথিয়া",
        "ফরিদপুর"
      ]
    },
    {
      "জেলা": "বগুড়া",
      "উপজেলা": [
        "কাহালু উপজেলা",
        "বগুড়া সদর",
        "সারিয়াকান্দি",
        "শাজাহানপুর",
        "দুপচাচিঁয়া উপজেলা",
        "আদমদিঘি উপজেলা",
        "নন্দিগ্রাম",
        "সোনাতলা উপজেলা",
        "ধুনট উপজেলা",
        "গাবতলী",
        "শেরপুর উপজেলা",
        "শিবগঞ্জ"
      ]
    },
    {
      "জেলা": "রাজশাহী",
      "উপজেলা": [
        "পবা উপজেলা",
        "দুর্গাপুর উপজেলা",
        "মোহনপুর উপজেলা",
        "চারঘাট উপজেলা",
        "পুঠিয়া উপজেলা",
        "বাঘা উপজেলা",
        "গোদাগাড়ী উপজেলা",
        "তানোর উপজেলা",
        "বাগমারা উপজেলা"
      ]
    },
    {
      "জেলা": "নাটোর",
      "উপজেলা": [
        "নাটোর সদর",
        "সিংড়া",
        "বড়াইগ্রাম",
        "বাগাতিপাড়া",
        "লালপুর",
        "গুরুদাসপুর",
        "নলডাঙ্গা"
      ]
    },
    {
      "জেলা": "জয়পুরহাট",
      "উপজেলা": [
        "আক্কেলপুর উপজেলা",
        "কালাই উপজেলা",
        "ক্ষেতলাল উপজেলা",
        "পাঁচবিবি উপজেলা",
        "জয়পুরহাট সদর"
      ]
    },
    {
      "জেলা": "চাঁপাইনবাবগঞ্জ",
      "উপজেলা": [
        "চাঁপাইনবাবগঞ্জ সদর",
        "গোমস্তাপুর",
        "নাচোল",
        "ভোলাহাট",
        "শিবগঞ্জ"
      ]
    },
    {
      "জেলা": "নওগাঁ",
      "উপজেলা": [
        "মহাদেবপুর উপজেলা",
        "বদলগাছী উপজেলা",
        "পত্নিতলা উপজেলা",
        "ধামইরহাট উপজেলা",
        "নিয়ামতপুর উপজেলা",
        "মান্দা উপজেলা",
        "আত্রাই উপজেলা",
        "রাণীনগর উপজেলা",
        "নওগাঁ সদর",
        "পোরশা উপজেলা",
        "সাপাহার"
      ]
    }
  ],
  "খুলনা বিভাগ": [
    {
      "জেলা": "যশোর",
      "উপজেলা": [
        "মণিরামপুর",
        "অভয়নগর",
        "বাঘারপাড়া",
        "চৌগাছা",
        "ঝিকরগাছা",
        "কেশবপুর",
        "যশোর সদর",
        "শার্শা"
      ]
    },
    {
      "জেলা": "সাতক্ষীরা",
      "উপজেলা": [
        "আশাশুনি",
        "দেবহাটা",
        "কলারোয়া",
        "সাতক্ষীরা সদর",
        "শ্যামনগর",
        "তালা",
        "কালিগঞ্জ"
      ]
    },
    {
      "জেলা": "মেহেরপুর",
      "উপজেলা": [
        "মুজিবনগর",
        "মেহেরপুর সদর",
        "গাংনী"
      ]
    },
    {
      "জেলা": "নড়াইল",
      "উপজেলা": [
        "নড়াইল সদর",
        "লোহাগড়া",
        "কালিয়া"
      ]
    },
    {
      "জেলা": "চুয়াডাঙ্গা",
      "উপজেলা": [
        "চুয়াডাঙ্গা সদর",
        "আলমডাঙ্গা",
        "দামুড়হুদা",
        "জীবননগর"
      ]
    },
    {
      "জেলা": "কুষ্টিয়া",
      "উপজেলা": [
        "কুষ্টিয়া সদর",
        "কুমারখালী",
        "খোকসা",
        "মিরপুর",
        "দৌলতপুর",
        "ভেড়ামারা"
      ]
    },
    {
      "জেলা": "মাগুরা",
      "উপজেলা": [
        "শালিখা",
        "শ্রীপুর",
        "মাগুরা সদর",
        "মহম্মদপুর"
      ]
    },
    {
      "জেলা": "খুলনা",
      "উপজেলা": [
        "পাইকগাছা",
        "ফুলতলা উপজেলা",
        "দিঘলিয়া উপজেলা",
        "রূপসা উপজেলা",
        "তেরখাদা উপজেলা",
        "ডুমুরিয়া উপজেলা",
        "বটিয়াঘাটা",
        "দাকোপ উপজেলা",
        "কয়রা উপজেলা"
      ]
    },
    {
      "জেলা": "বাগেরহাট",
      "উপজেলা": [
        "ফকিরহাট",
        "বাগেরহাট সদর",
        "মোল্লাহাট",
        "শরণখোলা",
        "রামপাল",
        "মোড়েলগঞ্জ",
        "কচুয়া",
        "মোংলা",
        "চিতলমারী"
      ]
    },
    {
      "জেলা": "ঝিনাইদহ",
      "উপজেলা": [
        "ঝিনাইদহ সদর",
        "শৈলকুপা",
        "হরিণাকুন্ডু",
        "কালীগঞ্জ",
        "কোটচাঁদপুর",
        "মহেশপুর"
      ]
    }
  ],
  "বরিশাল বিভাগ": [
    {
      "জেলা": "ঝালকাঠি",
      "উপজেলা": [
        "ঝালকাঠি সদর",
        "কাঠালিয়া",
        "নলছিটি",
        "রাজাপুর"
      ]
    },
    {
      "জেলা": "পটুয়াখালী",
      "উপজেলা": [
        "বাউফল",
        "পটুয়াখালী সদর",
        "দুমকি",
        "দশমিনা",
        "কলাপাড়া",
        "মির্জাগঞ্জ",
        "গলাচিপা",
        "রাঙ্গাবালী"
      ]
    },
    {
      "জেলা": "পিরোজপুর",
      "উপজেলা": [
        "পিরোজপুর সদর",
        "নাজিরপুর",
        "কাউখালী",
        "ভান্ডারিয়া",
        "মঠবাড়ীয়া",
        "নেছারাবাদ",
        "ইন্দুরকানি"
      ]
    },
    {
      "জেলা": "বরিশাল",
      "উপজেলা": [
        "বরিশাল সদর",
        "বাকেরগঞ্জ",
        "বাবুগঞ্জ",
        "উজিরপুর",
        "বানারীপাড়া",
        "গৌরনদী",
        "আগৈলঝাড়া",
        "মেহেন্দিগঞ্জ",
        "মুলাদী",
        "হিজলা"
      ]
    },
    {
      "জেলা": "ভোলা",
      "উপজেলা": [
        "ভোলা সদর",
        "বোরহান উদ্দিন",
        "চরফ্যাশন",
        "দৌলতখান",
        "মনপুরা",
        "তজুমদ্দিন",
        "লালমোহন"
      ]
    },
    {
      "জেলা": "বরগুনা",
      "উপজেলা": [
        "আমতলী",
        "বরগুনা সদর",
        "বেতাগী উপজেলা",
        "বামনা",
        "পাথরঘাটা",
        "তালতলি"
      ]
    }
  ],
  "সিলেট বিভাগ": [
    {
      "জেলা": "সিলেট",
      "উপজেলা": [
        "বালাগঞ্জ",
        "বিয়ানীবাজার",
        "বিশ্বনাথ",
        "কোম্পানীগঞ্জ",
        "ফেঞ্চুগঞ্জ",
        "গোলাপগঞ্জ",
        "গোয়াইনঘাট",
        "জৈন্তাপুর",
        "কানাইঘাট",
        "সিলেট সদর",
        "জকিগঞ্জ",
        "দক্ষিণ সুরমা",
        "ওসমানী"
      ]
    },
    {
      "জেলা": "মৌলভীবাজার",
      "উপজেলা": [
        "বড়লেখা",
        "কমলগঞ্জ",
        "কুলাউড়া",
        "মৌলভীবাজার সদর",
        "রাজনগর",
        "শ্রীমঙ্গল",
        "জুড়ী"
      ]
    },
    {
      "জেলা": "হবিগঞ্জ",
      "উপজেলা": [
        "নবীগঞ্জ",
        "বাহুবল",
        "আজমিরীগঞ্জ",
        "বানিয়াচং",
        "লাখাই",
        "চুনারুঘাট",
        "হবিগঞ্জ সদর",
        "মাধবপুর উপজেলা",
        "শায়েস্তাগঞ্জ"
      ]
    },
    {
      "জেলা": "সুনামগঞ্জ",
      "উপজেলা": [
        "সুনামগঞ্জ সদর",
        "দক্ষিণ সুনামগঞ্জ",
        "বিশ্বম্ভরপুর",
        "ছাতক",
        "জগন্নাথপুর",
        "দোয়ারাবাজার",
        "তাহিরপুর",
        "ধর্মপাশা",
        "জামালগঞ্জ",
        "শাল্লা",
        "দিরাই",
        "মধ্যনগর"
      ]
    }
  ],
  "ঢাকা বিভাগ": [
    {
      "জেলা": "নরসিংদী",
      "উপজেলা": [
        "বেলাবো",
        "মনোহরদী",
        "নরসিংদী",
        "পলাশ",
        "রায়পুরা",
        "শিবপুর"
      ]
    },
    {
      "জেলা": "গাজীপুর",
      "উপজেলা": [
        "কালীগঞ্জ",
        "কালিয়াকৈর",
        "কাপাসিয়া",
        "গাজীপুর সদর",
        "শ্রীপুর"
      ]
    },
    {
      "জেলা": "শরীয়তপুর",
      "উপজেলা": [
        "শরিয়তপুর সদর",
        "নড়িয়া",
        "জাজিরা",
        "গোসাইরহাট",
        "ভেদরগঞ্জ",
        "ডামুড্যা"
      ]
    },
    {
      "জেলা": "নারায়ণগঞ্জ",
      "উপজেলা": [
        "আড়াইহাজার উপজেলা",
        "বন্দর উপজেলা",
        "নারায়নগঞ্জ সদর",
        "রূপগঞ্জ উপজেলা",
        "সোনারগাঁ উপজেলা"
      ]
    },
    {
      "জেলা": "টাঙ্গাইল",
      "উপজেলা": [
        "বাসাইল",
        "ভুয়াপুর",
        "দেলদুয়ার",
        "ঘাটাইল",
        "গোপালপুর",
        "মধুপুর",
        "মির্জাপুর",
        "নাগরপুর",
        "সখিপুর",
        "টাঙ্গাইল সদর",
        "কালিহাতী",
        "ধনবাড়ী"
      ]
    },
    {
      "জেলা": "কিশোরগঞ্জ",
      "উপজেলা": [
        "ইটনা",
        "কটিয়াদী",
        "ভৈরব",
        "তাড়াইল",
        "হোসেনপুর",
        "পাকুন্দিয়া",
        "কুলিয়ারচর",
        "কিশোরগঞ্জ সদর",
        "করিমগঞ্জ",
        "বাজিতপুর",
        "অষ্টগ্রাম",
        "মিঠামইন",
        "নিকলী"
      ]
    },
    {
      "জেলা": "মানিকগঞ্জ",
      "উপজেলা": [
        "হরিরামপুর",
        "সাটুরিয়া",
        "মানিকগঞ্জ সদর",
        "ঘিওর",
        "শিবালয়",
        "দৌলতপুর",
        "সিংগাইর"
      ]
    },
    {
      "জেলা": "ঢাকা",
      "উপজেলা": [
        "আগারগাঁও",
        "আদাবর",
        "আরমানিটোলা",
        "ইসলামপুর",
        "উত্তর খান",
        "উত্তর বড্ডা",
        "উত্তরখান",
        "উত্তরা",
        "এয়ারপোর্ট",
        "ওয়ারী",
        "কমলাপুর",
        "কলাবাগান",
        "কাকরাইল",
        "কাজীপাড়া",
        "কাদমতলী",
        "কাফরুল",
        "কামরাঙ্গীরচর",
        "কুড়িল",
        "কোতওয়ালী",
        "কোতওয়ালী পুলিশ লাইন",
        "ক্যান্টনমেন্ট",
        "খিলক্ষেত",
        "খিলগাঁও",
        "খিলগাঁও তালতলা",
        "গাবতলী",
        "গুলশান",
        "গুলশান মডেল টাউন",
        "গেন্ডারিয়া",
        "গ্রিন রোড",
        "চকবাজার",
        "জিগাতোলা",
        "জুরাইন",
        "ঝিগাতলা",
        "টঙ্গি",
        "টিকাটুলি",
        "ডেমরা",
        "ঢাকা ক্যান্টনমেন্ট",
        "তান্তি বাজার",
        "তেজগাঁও",
        "দক্ষিণখান",
        "দক্ষিন মুগদা",
        "দারুস সালাম",
        "দারুসসালাম",
        "ধলপুর",
        "ধানমন্ডি",
        "ধামরাই",
        "নতুন বাজার",
        "নবাবগঞ্জ",
        "নয়াটলা",
        "নয়াবাজার",
        "নিউমার্কেট",
        "নিকুঞ্জ",
        "নিকেতন",
        "পল্লবী",
        "পল্লবী এক্সটেনশন",
        "পান্থপথ",
        "পোস্টা",
        "পোস্তগোলা",
        "ফকিরাপুল",
        "ফার্মগেট",
        "বংশাল",
        "বড্ডা",
        "বড্ডা লিংক রোড",
        "বনশ্রী ব্লক-সি",
        "বনানী",
        "বসুন্ধরা",
        "বসুন্ধরা আর/এ",
        "বসুন্ধরা রেজিডেনশিয়াল এলাকা",
        "বসুন্ধরা রেজিডেন্সিয়াল এলাকা",
        "বাংলামটর",
        "বাড্ডা",
        "বারিধারা",
        "বাসাবো",
        "বিজয়নগর",
        "বেইলি রোড",
        "ভাটারা",
        "মগবাজার",
        "মতিঝিল",
        "মধ্য বড্ডা",
        "মনিপুর",
        "মহাখালী",
        "মহাখালী ডিওএইচএস",
        "মালিবাগ",
        "মালিবাগ চৌধুরীপাড়া",
        "মালিবাগ রেলগেট",
        "মিরপুর",
        "মিরপুর ক্যান্টনমেন্ট",
        "মিরপুর ডিওএইচএস",
        "মিরপুর-১",
        "মিরপুর-১০",
        "মিরপুর-১১",
        "মিরপুর-১২",
        "মিরপুর-১৩",
        "মিরপুর-১৪",
        "মিরপুর-২",
        "মিরপুর-৬",
        "মিরপুর-৭",
        "মেরুল বড্ডা",
        "মোহাম্মদপুর",
        "মোহাম্মদপুর কৃষি মার্কেট",
        "মোহাম্মদপুর হাউজিং",
        "মৌচাক",
        "যাত্রাবাড়ি",
        "রামপুরা",
        "রামপুরা বাজার",
        "রায়ের বাজার",
        "রায়েরবাজার",
        "রূপনগর",
        "লক্ষ্মীবাজার",
        "লালবাগ",
        "লালমাটিয়া",
        "শান্তিনগর",
        "শান্তিবাগ",
        "শান্তিবাগ আর/এ",
        "শাহ আলী",
        "শাহবাগ",
        "শেওড়াপাড়া",
        "শের-ই-বাংলা নগর",
        "শ্যামপুর",
        "শ্যামলী",
        "সিদ্ধেশ্বরী",
        "সুত্রাপুর",
        "হাতিরঝিল",
        "হাতিরপুল"
      ]
    }
    ,
    {
      "জেলা": "মুন্সিগঞ্জ",
      "উপজেলা": [
        "মুন্সিগঞ্জ সদর",
        "শ্রীনগর",
        "সিরাজদিখান",
        "লৌহজং",
        "গজারিয়া",
        "টংগীবাড়ি"
      ]
    },
    {
      "জেলা": "রাজবাড়ী",
      "উপজেলা": [
        "রাজবাড়ী সদর",
        "গোয়ালন্দ",
        "পাংশা",
        "বালিয়াকান্দি",
        "কালুখালী"
      ]
    },
    {
      "জেলা": "মাদারীপুর",
      "উপজেলা": [
        "মাদারীপুর সদর",
        "শিবচর",
        "কালকিনি",
        "রাজৈর",
        "ডাসার"
      ]
    },
    {
      "জেলা": "গোপালগঞ্জ",
      "উপজেলা": [
        "গোপালগঞ্জ সদর",
        "কাশিয়ানী",
        "টুংগীপাড়া",
        "কোটালীপাড়া",
        "মুকসুদপুর"
      ]
    },
    {
      "জেলা": "ফরিদপুর",
      "উপজেলা": [
        "ফরিদপুর সদর",
        "আলফাডাঙ্গা",
        "বোয়ালমারী",
        "সদরপুর",
        "নগরকান্দা",
        "ভাঙ্গা",
        "চরভদ্রাসন",
        "মধুখালী",
        "সালথা"
      ]
    }
  ],
  "রংপুর বিভাগ": [
    {
      "জেলা": "পঞ্চগড়",
      "উপজেলা": [
        "পঞ্চগড়",
        "দেবীগঞ্জ",
        "বোদা",
        "আটোয়ারী",
        "তেতুলিয়া"
      ]
    },
    {
      "জেলা": "দিনাজপুর",
      "উপজেলা": [
        "নবাবগঞ্জ",
        "বীরগঞ্জ উপজেলা",
        "ঘোড়াঘাট",
        "বিরামপুর",
        "পার্বতীপুর উপজেলা",
        "বোচাগঞ্জ উপজেলা",
        "কাহারোল উপজেলা",
        "ফুলবাড়ী উপজেলা",
        "দিনাজপুর সদর",
        "হাকিমপুর উপজেলা",
        "খানসামা",
        "বিরল উপজেলা",
        "চিরিরবন্দর উপজেলা"
      ]
    },
    {
      "জেলা": "লালমনিরহাট",
      "উপজেলা": [
        "লালমনিরহাট সদর",
        "কালীগঞ্জ",
        "হাতীবান্ধা",
        "পাটগ্রাম",
        "আদিতমারী উপজেলা"
      ]
    },
    {
      "জেলা": "নীলফামারী",
      "উপজেলা": [
        "সৈয়দপুর উপজেলা",
        "ডোমার উপজেলা",
        "ডিমলা",
        "জলঢাকা",
        "কিশোরগঞ্জ",
        "নীলফামারী সদর"
      ]
    },
    {
      "জেলা": "গাইবান্ধা",
      "উপজেলা": [
        "সাদুল্লাপুর",
        "গাইবান্ধা সদর",
        "পলাশবাড়ী",
        "সাঘাটা উপজেলা",
        "গোবিন্দগঞ্জ উপজেলা",
        "সুন্দরগঞ্জ",
        "ফুলছড়ি"
      ]
    },
    {
      "জেলা": "ঠাকুরগাঁও",
      "উপজেলা": [
        "ঠাকুরগাঁও সদর",
        "পীরগঞ্জ উপজেলা",
        "রাণীশংকৈল উপজেলা",
        "হরিপুর উপজেলা",
        "বালিয়াডাঙ্গী উপজেলা"
      ]
    },
    {
      "জেলা": "রংপুর",
      "উপজেলা": [
        "রংপুর সদর",
        "গংগাচড়া",
        "তারাগঞ্জ উপজেলা",
        "বদরগঞ্জ উপজেলা",
        "মিঠাপুকুর উপজেলা",
        "পীরগঞ্জ উপজেলা",
        "কাউনিয়া উপজেলা",
        "পীরগাছা উপজেলা"
      ]
    },
    {
      "জেলা": "কুড়িগ্রাম",
      "উপজেলা": [
        "কুড়িগ্রাম সদর",
        "নাগেশ্বরী",
        "ভুরুঙ্গামারী",
        "ফুলবাড়ী",
        "রাজারহাট",
        "উলিপুর",
        "চিলমারী",
        "রৌমারী",
        "চর রাজিবপুর"
      ]
    }
  ],
  "ময়মনসিংহ বিভাগ": [
    {
      "জেলা": "শেরপুর",
      "উপজেলা": [
        "শেরপুর সদর",
        "নালিতাবাড়ী উপজেলা",
        "শ্রীবরদী উপজেলা",
        "নকলা উপজেলা",
        "ঝিনাইগাতী উপজেলা"
      ]
    },
    {
      "জেলা": "ময়মনসিংহ",
      "উপজেলা": [
        "ফুলবাড়ীয়া",
        "ত্রিশাল",
        "ভালুকা",
        "মুক্তাগাছা",
        "ময়মনসিংহ সদর",
        "ধোবাউড়া",
        "ফুলপুর",
        "হালুয়াঘাট",
        "গৌরীপুর",
        "গফরগাঁও",
        "ঈশ্বরগঞ্জ",
        "নান্দাইল",
        "তারাকান্দা"
      ]
    },
    {
      "জেলা": "জামালপুর",
      "উপজেলা": [
        "জামালপুর সদর",
        "মেলান্দহ",
        "ইসলামপুর",
        "দেওয়ানগঞ্জ",
        "সরিষাবাড়ী",
        "মাদারগঞ্জ",
        "বকশীগঞ্জ"
      ]
    },
    {
      "জেলা": "নেত্রকোণা",
      "উপজেলা": [
        "বারহাট্টা",
        "দুর্গাপুর",
        "কেন্দুয়া",
        "আটপাড়া",
        "মদন",
        "খালিয়াজুরী",
        "কলমাকান্দা",
        "মোহনগঞ্জ",
        "পূর্বধলা",
        "নেত্রকোণা সদর"
      ]
    }
  ]
};
